#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️``
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
data.aws_iam_policy.aws_managed_s3_full_access: Reading...
module.eks.data.aws_partition.current: Reading...
data.aws_caller_identity.current: Reading...
module.eks.data.aws_caller_identity.current: Reading...
data.aws_iam_policy.aws_ec2_full_access: Reading...
data.aws_iam_policy.aws_managed_ecr_full_access: Reading...
module.eks.data.aws_iam_policy_document.assume_role_policy[0]: Reading...
data.aws_iam_policy.aws_managed_ecr_power_user_policy: Reading...
module.irsa-ebs-csi.data.aws_caller_identity.current: Reading...
module.eks.aws_cloudwatch_log_group.this[0]: Refreshing state... [id=/aws/eks/bodhi-int-eks/cluster]
module.eks.data.aws_partition.current: Read complete after 0s [id=aws]
data.aws_iam_policy.aws_managed_read_only_access: Reading...
module.eks.data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2764486067]
data.aws_iam_policy.ebs_csi_policy: Reading...
data.aws_iam_policy.aws_managed_ecr_full_access: Read complete after 0s [id=arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryFullAccess]
module.eks.module.kms.data.aws_partition.current[0]: Reading...
data.aws_iam_policy.aws_ec2_full_access: Read complete after 0s [id=arn:aws:iam::aws:policy/AmazonEC2FullAccess]
module.eks.module.kms.data.aws_partition.current[0]: Read complete after 0s [id=aws]
data.aws_region.current: Reading...
data.aws_region.current: Read complete after 0s [id=ap-southeast-1]
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-0a9d8458221f98f37]
aws_s3_bucket.bodhi_file_bucket: Refreshing state... [id=bodhi-file-bucket]
data.aws_iam_policy.ebs_csi_policy: Read complete after 0s [id=arn:aws:iam::aws:policy/service-role/AmazonEBSCSIDriverPolicy]
data.aws_iam_policy.aws_managed_ecr_power_user_policy: Read complete after 0s [id=arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryPowerUser]
module.eks.module.kms.data.aws_caller_identity.current[0]: Reading...
data.aws_iam_policy.aws_managed_s3_full_access: Read complete after 0s [id=arn:aws:iam::aws:policy/AmazonS3FullAccess]
aws_s3_bucket.bodhi_image_bucket: Refreshing state... [id=bodhi-image-bucket]
module.irsa-ebs-csi.data.aws_partition.current: Reading...
module.irsa-ebs-csi.data.aws_partition.current: Read complete after 0s [id=aws]
data.aws_iam_policy.aws_managed_read_only_access: Read complete after 0s [id=arn:aws:iam::aws:policy/ReadOnlyAccess]
module.eks.aws_iam_role.this[0]: Refreshing state... [id=bodhi-int-eks-cluster-20241014091753202000000001]
data.aws_caller_identity.current: Read complete after 0s [id=476114114107]
module.eks.aws_iam_role_policy_attachment.this["AmazonEKSVPCResourceController"]: Refreshing state... [id=bodhi-int-eks-cluster-20241014091753202000000001-20241014091753524700000002]
module.eks.aws_iam_role_policy_attachment.this["AmazonEKSClusterPolicy"]: Refreshing state... [id=bodhi-int-eks-cluster-20241014091753202000000001-20241014091753590700000003]
module.eks.data.aws_caller_identity.current: Read complete after 0s [id=476114114107]
module.eks.data.aws_iam_session_context.current: Reading...
module.eks.data.aws_iam_session_context.current: Read complete after 1s [id=arn:aws:sts::476114114107:assumed-role/github-oidc-role/terraform-infra-provision-session]
module.irsa-ebs-csi.data.aws_caller_identity.current: Read complete after 1s [id=476114114107]
module.eks.module.kms.data.aws_caller_identity.current[0]: Read complete after 1s [id=476114114107]
module.eks.module.kms.data.aws_iam_policy_document.this[0]: Reading...
module.eks.module.kms.data.aws_iam_policy_document.this[0]: Read complete after 0s [id=1287776765]
module.eks.module.kms.aws_kms_key.this[0]: Refreshing state... [id=f2ff4364-802e-4cfb-b72e-c6df357506fd]
module.eks.module.kms.aws_kms_alias.this["cluster"]: Refreshing state... [id=alias/eks/bodhi-int-eks]
module.eks.aws_iam_policy.cluster_encryption[0]: Refreshing state... [id=arn:aws:iam::476114114107:policy/bodhi-int-eks-cluster-ClusterEncryption20241014091821157400000008]
module.eks.aws_iam_role_policy_attachment.cluster_encryption[0]: Refreshing state... [id=bodhi-int-eks-cluster-20241014091753202000000001-20241014091821382100000009]
module.vpc.aws_vpc_ipv4_cidr_block_association.this[0]: Refreshing state... [id=vpc-cidr-assoc-006a1e9311cf11f88]
module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-07a141daeb5cbc060]
module.eks.aws_security_group.cluster[0]: Refreshing state... [id=sg-04958eba1b3abe078]
module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-00cd924de82b36051]
module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-00858e7f3e8e60f5c]
module.eks.aws_security_group.node[0]: Refreshing state... [id=sg-0559079df1e6144e8]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-0747f29838df91d97]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-0669be7fff14179ad]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-02e96125f1d14517e]
module.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-056120aae89290e81]
module.vpc.aws_route_table.private[2]: Refreshing state... [id=rtb-06a67527fc11e591a]
module.vpc.aws_subnet.private[3]: Refreshing state... [id=subnet-0b47eaae98c25f132]
module.vpc.aws_subnet.private[4]: Refreshing state... [id=subnet-08f964cd354acfa23]
module.vpc.aws_subnet.private[5]: Refreshing state... [id=subnet-010543bc138fcea50]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-0e85ca0fce059eb11]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-05a2c3d6a7b1b2837]
module.vpc.aws_subnet.private[2]: Refreshing state... [id=subnet-010d0dc62bd940540]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0813788553314e761]
module.vpc.aws_subnet.public[3]: Refreshing state... [id=subnet-0e19b1c52e06a29a9]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-031d07681118b1fa5]
module.vpc.aws_subnet.public[2]: Refreshing state... [id=subnet-0e7d915b884c211c1]
module.vpc.aws_subnet.public[4]: Refreshing state... [id=subnet-0baf858c54c6671c5]
module.vpc.aws_subnet.public[5]: Refreshing state... [id=subnet-03caccdd614823f7a]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-0747f29838df91d971080289494]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-0ea25e2b01d757771]
module.vpc.aws_eip.nat[1]: Refreshing state... [id=eipalloc-0dfc3b169d203524d]
module.vpc.aws_eip.nat[2]: Refreshing state... [id=eipalloc-0a64fef9f2231fb55]
module.eks.aws_security_group_rule.node["ingress_self_coredns_udp"]: Refreshing state... [id=sgrule-3244037212]
module.eks.aws_security_group_rule.node["ingress_cluster_4443_webhook"]: Refreshing state... [id=sgrule-1245629660]
module.eks.aws_security_group_rule.node["ingress_cluster_443"]: Refreshing state... [id=sgrule-2684604780]
module.eks.aws_security_group_rule.node["prometheus_service_ingress_rule"]: Refreshing state... [id=sgrule-2624851430]
module.eks.aws_security_group_rule.node["ingress_cluster_8443_webhook"]: Refreshing state... [id=sgrule-2418055019]
module.eks.aws_security_group_rule.node["ingress_cluster_kubelet"]: Refreshing state... [id=sgrule-1989882638]
module.eks.aws_security_group_rule.node["ingress_nodes_ephemeral"]: Refreshing state... [id=sgrule-1291461012]
module.eks.aws_security_group_rule.node["ingress_cluster_9443_webhook"]: Refreshing state... [id=sgrule-4102136992]
module.eks.aws_security_group_rule.node["node_exporter_ingress_rule"]: Refreshing state... [id=sgrule-2719681735]
module.eks.aws_security_group_rule.node["ingress_cluster_6443_webhook"]: Refreshing state... [id=sgrule-2205985610]
module.eks.aws_security_group_rule.node["ingress_self_coredns_tcp"]: Refreshing state... [id=sgrule-1694742451]
module.eks.aws_security_group_rule.node["olm_package_server_ingress_rule"]: Refreshing state... [id=sgrule-782237463]
module.eks.aws_security_group_rule.node["egress_all"]: Refreshing state... [id=sgrule-2114199985]
module.vpc.aws_route_table_association.private[5]: Refreshing state... [id=rtbassoc-01295f817414188b2]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-075b0b39a54e09b76]
module.vpc.aws_route_table_association.private[3]: Refreshing state... [id=rtbassoc-07317b15b5e597901]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0153a91528cacd0a6]
module.vpc.aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-0e3ef233597c72aa4]
module.vpc.aws_route_table_association.private[4]: Refreshing state... [id=rtbassoc-0197ba485f733e68c]
module.eks.aws_security_group_rule.cluster["ingress_nodes_443"]: Refreshing state... [id=sgrule-3959025701]
module.vpc.aws_route_table_association.public[5]: Refreshing state... [id=rtbassoc-048aba9613a035864]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-03c323020cb673ede]
module.vpc.aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-0b42c7a702eb7e567]
module.vpc.aws_route_table_association.public[3]: Refreshing state... [id=rtbassoc-0fe39e7335c334869]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-055a21142ac3b8882]
module.vpc.aws_route_table_association.public[4]: Refreshing state... [id=rtbassoc-00cb15d5986ad6d75]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-093263e973120428c]
module.vpc.aws_nat_gateway.this[1]: Refreshing state... [id=nat-033590265c7997c91]
module.vpc.aws_nat_gateway.this[2]: Refreshing state... [id=nat-045775dd6d28002fd]
module.eks.module.eks_managed_node_group["k8s-core"].data.aws_partition.current: Reading...
module.eks.module.eks_managed_node_group["k8s-core"].data.aws_partition.current: Read complete after 0s [id=aws]
module.eks.module.eks_managed_node_group["int"].data.aws_partition.current: Reading...
module.eks.module.eks_managed_node_group["int"].data.aws_partition.current: Read complete after 0s [id=aws]
module.eks.module.eks_managed_node_group["k8s-core"].data.aws_caller_identity.current: Reading...
module.eks.module.eks_managed_node_group["int"].data.aws_caller_identity.current: Reading...
module.eks.module.eks_managed_node_group["int"].data.aws_iam_policy_document.assume_role_policy[0]: Reading...
module.eks.module.eks_managed_node_group["k8s-core"].data.aws_iam_policy_document.assume_role_policy[0]: Reading...
module.eks.module.eks_managed_node_group["int"].data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2560088296]
module.eks.module.eks_managed_node_group["k8s-core"].data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2560088296]
module.eks.module.eks_managed_node_group["k8s-core"].aws_iam_role.this[0]: Refreshing state... [id=k8s-core-eks-node-group-20241014093431756400000002]
module.eks.module.eks_managed_node_group["int"].aws_iam_role.this[0]: Refreshing state... [id=int-eks-node-group-20241014093431551400000001]
module.vpc.aws_route.private_nat_gateway[1]: Refreshing state... [id=r-rtb-056120aae89290e811080289494]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-02e96125f1d14517e1080289494]
module.vpc.aws_route.private_nat_gateway[2]: Refreshing state... [id=r-rtb-06a67527fc11e591a1080289494]
module.eks.aws_eks_cluster.this[0]: Refreshing state... [id=bodhi-int-eks]
module.eks.module.eks_managed_node_group["k8s-core"].data.aws_caller_identity.current: Read complete after 1s [id=476114114107]
module.eks.module.eks_managed_node_group["int"].data.aws_caller_identity.current: Read complete after 1s [id=476114114107]
module.eks.module.eks_managed_node_group["k8s-core"].aws_iam_role_policy_attachment.this["AmazonEKSWorkerNodePolicy"]: Refreshing state... [id=k8s-core-eks-node-group-20241014093431756400000002-20241014093432044000000003]
module.eks.module.eks_managed_node_group["int"].aws_iam_role_policy_attachment.this["AmazonEC2ContainerRegistryReadOnly"]: Refreshing state... [id=int-eks-node-group-20241014093431551400000001-20241014093432373700000006]
module.eks.module.eks_managed_node_group["k8s-core"].aws_iam_role_policy_attachment.this["AmazonEC2ContainerRegistryReadOnly"]: Refreshing state... [id=k8s-core-eks-node-group-20241014093431756400000002-20241014093432279800000005]
module.eks.module.eks_managed_node_group["int"].aws_iam_role_policy_attachment.this["AmazonEKSWorkerNodePolicy"]: Refreshing state... [id=int-eks-node-group-20241014093431551400000001-20241014093432477500000007]
module.eks.module.eks_managed_node_group["int"].aws_iam_role_policy_attachment.this["AmazonEKS_CNI_Policy"]: Refreshing state... [id=int-eks-node-group-20241014093431551400000001-20241014093432542500000008]
module.eks.module.eks_managed_node_group["k8s-core"].aws_iam_role_policy_attachment.this["AmazonEKS_CNI_Policy"]: Refreshing state... [id=k8s-core-eks-node-group-20241014093431756400000002-20241014093432160400000004]
module.eks.data.tls_certificate.this[0]: Reading...
module.eks.aws_eks_access_entry.this["cluster_creator"]: Refreshing state... [id=bodhi-int-eks:arn:aws:iam::476114114107:role/github-oidc-role]
module.eks.time_sleep.this[0]: Refreshing state... [id=2024-10-14T09:44:00Z]
module.eks.module.eks_managed_node_group["k8s-core"].module.user_data.null_resource.validate_cluster_service_cidr: Refreshing state... [id=7314370506267146074]
module.eks.module.eks_managed_node_group["int"].module.user_data.null_resource.validate_cluster_service_cidr: Refreshing state... [id=3261890501206656181]
module.eks.module.eks_managed_node_group["k8s-core"].aws_launch_template.this[0]: Refreshing state... [id=lt-0d41e868704652f3f]
module.eks.module.eks_managed_node_group["int"].aws_launch_template.this[0]: Refreshing state... [id=lt-01490e17eecf85913]
module.eks.aws_eks_access_policy_association.this["cluster_creator_admin"]: Refreshing state... [id=bodhi-int-eks#arn:aws:iam::476114114107:role/github-oidc-role#arn:aws:eks::aws:cluster-access-policy/AmazonEKSClusterAdminPolicy]
module.eks.module.eks_managed_node_group["int"].aws_eks_node_group.this[0]: Refreshing state... [id=bodhi-int-eks:int-20241014094404134000000011]
module.eks.data.tls_certificate.this[0]: Read complete after 1s [id=02f0b3f30424129b8a14276375b6aebec81a5e17]
module.eks.aws_iam_openid_connect_provider.oidc_provider[0]: Refreshing state... [id=arn:aws:iam::476114114107:oidc-provider/oidc.eks.ap-southeast-1.amazonaws.com/id/63F70535F3EBEB91D99661071E0DDAA4]
module.irsa-ebs-csi.data.aws_iam_policy_document.assume_role_with_oidc[0]: Reading...
module.irsa-ebs-csi.data.aws_iam_policy_document.assume_role_with_oidc[0]: Read complete after 0s [id=1929159781]
module.irsa-ebs-csi.aws_iam_role.this[0]: Refreshing state... [id=AmazonEKSTFEBSCSIRole-ap-east-1-bodhi-int-eks]
module.irsa-ebs-csi.aws_iam_role_policy_attachment.custom[0]: Refreshing state... [id=AmazonEKSTFEBSCSIRole-ap-east-1-bodhi-int-eks-2024101409433311580000000c]
module.eks.data.aws_eks_addon_version.this["aws-ebs-csi-driver"]: Reading...
module.eks.data.aws_eks_addon_version.this["aws-ebs-csi-driver"]: Read complete after 0s [id=aws-ebs-csi-driver]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.eks.aws_eks_addon.this["aws-ebs-csi-driver"] will be created
  + resource "aws_eks_addon" "this" {
      + addon_name                  = "aws-ebs-csi-driver"
      + addon_version               = "v1.33.0-eksbuild.1"
      + arn                         = (known after apply)
      + cluster_name                = "bodhi-int-eks"
      + configuration_values        = (known after apply)
      + created_at                  = (known after apply)
      + id                          = (known after apply)
      + modified_at                 = (known after apply)
      + preserve                    = true
      + resolve_conflicts_on_create = "OVERWRITE"
      + resolve_conflicts_on_update = "OVERWRITE"
      + service_account_role_arn    = "arn:aws:iam::476114114107:role/AmazonEKSTFEBSCSIRole-ap-east-1-bodhi-int-eks"
      + tags_all                    = (known after apply)

      + timeouts {}
    }

  # module.eks.module.eks_managed_node_group["k8s-core"].aws_eks_node_group.this[0] will be created
  + resource "aws_eks_node_group" "this" {
      + ami_type               = "AL2_x86_64"
      + arn                    = (known after apply)
      + capacity_type          = "ON_DEMAND"
      + cluster_name           = "bodhi-int-eks"
      + disk_size              = (known after apply)
      + id                     = (known after apply)
      + instance_types         = [
          + "t3.micro",
        ]
      + labels                 = {
          + "nodegroup" = "k8s-core"
        }
      + node_group_name        = (known after apply)
      + node_group_name_prefix = "k8s-core-"
      + node_role_arn          = "arn:aws:iam::476114114107:role/k8s-core-eks-node-group-20241014093431756400000002"
      + release_version        = (known after apply)
      + resources              = (known after apply)
      + status                 = (known after apply)
      + subnet_ids             = [
          + "subnet-010d0dc62bd940540",
          + "subnet-05a2c3d6a7b1b2837",
          + "subnet-0e85ca0fce059eb11",
        ]
      + tags                   = {
          + "Name"                                    = "k8s-core"
          + "k8s.io/cluster-autoscaler/bodhi-int-eks" = "owned"
          + "k8s.io/cluster-autoscaler/enabled"       = "TRUE"
        }
      + tags_all               = {
          + "Name"                                    = "k8s-core"
          + "k8s.io/cluster-autoscaler/bodhi-int-eks" = "owned"
          + "k8s.io/cluster-autoscaler/enabled"       = "TRUE"
        }
      + version                = "1.29"

      + launch_template {
          + id      = "lt-0d41e868704652f3f"
          + name    = (known after apply)
          + version = "1"
        }

      + scaling_config {
          + desired_size = 1
          + max_size     = 2
          + min_size     = 1
        }

      + timeouts {}

      + update_config {
          + max_unavailable_percentage = 33
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Warning: Argument is deprecated

  with module.eks.aws_iam_role.this[0],
  on .terraform/modules/eks/main.tf line 387, in resource "aws_iam_role" "this":
 387: resource "aws_iam_role" "this" {

The inline_policy argument is deprecated. Use the aws_iam_role_policy
resource instead. If Terraform should exclusively manage all inline policy
associations (the current behavior of this argument), use the
aws_iam_role_policies_exclusive resource as well.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @DavidGoodman2333, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform Infra Plan - AP Southeast 1`*